read_verilog src/cpu.v src/alu.v src/regfile.v src/control.v src/immGen.v
synth_xilinx -top cpu
write_verilog synth/cpu_synth.v
